---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidServer
source: html/be45e502-8cce-5dec-709d-38cfcc9e91d2.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidServer Method

Returns true if the current rebar contains a valid server GUID, false otherwise.

## Syntax (C#)
```csharp
public bool HasValidServer()
```

## Returns
Returns true if the current rebar contains a valid server GUID, false otherwise.